package laofont_test

import (
	"testing"

	"github.com/jvongay/laofont"
)

func TestASCIIToUnicode(t *testing.T) {
	tt := []struct {
		name  string
		ascii string
		want  string
	}{
		{"", "¡", "ກ"},
		{"", "¢", "ຂ"},
		{"", "£", "ຄ"},
		{"", "¤", "ງ"},
		{"", "¥", "ຈ"},
		{"", "¦", "ສ"},
		{"", "§", "ຊ"},
		{"", "¨", "ຍ"},
		{"", "©", "ດ"},
		{"", "ª", "ຕ"},
		{"", "«", "ຖ"},
		{"", "ê", "ທ"},
		{"", "ß", "ນ"},      // ນ with newer ascii
		{"", "\u00ad", "ນ"}, // ນ with older ascii
		{"", "®", "ບ"},
		{"", "¯", "ປ"},
		{"", "°", "ຜ"},
		{"", "±", "ຝ"},
		{"", "²", "ພ"},
		{"", "³", "ຟ"},
		{"", "´", "ມ"},
		{"", "µ", "ຢ"},
		{"", "ì", "ລ"},
		{"", "ë", "ຣ"},
		{"", "¸", "ວ"},
		{"", "¹", "ຫ"},
		{"", "º", "ອ"},
		{"", "»", "ຮ"},
		{"", "½", "ະ"},
		{"", "¾", "າ"},
		{"", "ò", "ິ"},
		{"", "ó", "ີ"},
		{"", "ô", "ຶ"},
		{"", "õ", "ື"},
		{"", "÷", "ຸ"},
		{"", "ø", "ູ"},
		{"", "À", "ເ"},
		{"", "Á", "ແ"},
		{"", "Â", "ໂ"},
		{"", "ð", "ໍ"},
		{"", "ñ", "ັ"},
		{"", "ö", "ົ"},
		{"", "Ã", "ໃ"},
		{"", "Ä", "ໄ"},
		{"", "ú", "່"},
		{"", "È", "່"},
		{"", "û", "້"},
		{"", "É", "້"},
		{"", "ü", "໊"},
		{"", "ý", "໋"},
		{"", "Î", "ໜ"},
		{"", "Ï", "ໝ"},
		{"", "Í", "ຫຼ"},
		{"", "ù", "ຼ"},
		{"", "š", "ີ້"},
		{"", "™", "ິ້"},
		{"", "¿", "ຳ"},
		{"", "‡", "ຶ່"},
		{"", "Ò", "ໍ່"},
		{"", "¼", "ຽ"},
		{"", "˜", "ັ້"},
		{"", "µú¾¤¥ø®øìö´", "ຢ່າງຈູບູລົມ"},
		{"", "ì¾¸Âêì½£ö´", "ລາວໂທລະຄົມ"},
		{"", "©¸¤®÷®°¾", "ດວງບຸບຜາ"},
		{"", "Á¦­¦÷ìò­ê¾", "ແສນສຸລິນທາ"},
		{"", "ê.Á¡û¸¢¸ñ­À»õº­", "ທ.ແກ້ວຂວັນເຮືອນ"},
		{"", "ê.§¼¤êº­£ð¾", "ທ.ຊຽງທອນຄໍາ"},
		{"", `¢¾´¤º¨, À»õº­Àì¡êó:, §ñ­À»õº­:1, ´. 0405, ´.Ä§À¦©«¾, ­½£º­¹ù¸¤¸¼¤¥ñ­`, `ຂາມງອຍ, ເຮືອນເລກທີ:, ຊັນເຮືອນ:1, ມ. 0405, ມ.ໄຊເສດຖາ, ນະຄອນຫຼວງວຽງຈັນ`},
		{"", `©º­­ö¡¢û÷´, À»õº­Àì¡êó:, §ñ­À»õº­:1, ´. 0303, ´.¦ó¦ñ©ª½­¾¡, ­½£º­¹ù¸¤¸¼¤¥ñ­`, `ດອນນົກຂຸ້ມ, ເຮືອນເລກທີ:, ຊັນເຮືອນ:1, ມ. 0303, ມ.ສີສັດຕະນາກ, ນະຄອນຫຼວງວຽງຈັນ`},
		{"", `Â­­Á¡û¸, À»õº­Àì¡êó:, §ñ­À»õº­:1, ´. 0202, ´.¦óÂ£©ª½®º¤, ­½£º­¹ù¸¤¸¼¤¥ñ­`, `ໂນນແກ້ວ, ເຮືອນເລກທີ:, ຊັນເຮືອນ:1, ມ. 0202, ມ.ສີໂຄດຕະບອງ, ນະຄອນຫຼວງວຽງຈັນ`},
		{"", `®úð­¾¤ö¸, À»õº­Àì¡êó:, §ñ­À»õº­:1, ´. 0104, ´.¥ñ­ê½®øìó, ­½£º­¹ù¸¤¸¼¤¥ñ­`, `ບ່ໍນາງົວ, ເຮືອນເລກທີ:, ຊັນເຮືອນ:1, ມ. 0104, ມ.ຈັນທະບູລີ, ນະຄອນຫຼວງວຽງຈັນ`},
	}

	for _, tc := range tt {
		t.Run(tc.name, func(t *testing.T) {

			got := laofont.ASCIIToUnicode(tc.ascii)

			if got != tc.want {
				t.Fatalf(`convert from "%s" want "%s", but got "%s"`, tc.ascii, tc.want, got)
			}
		})
	}
}
